In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv('../data/raw/ds_salaries.csv',index_col=0)

In [3]:
data

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
Unnamed: 0,,,,,,,,,,,
0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L
...,...,...,...,...,...,...,...,...,...,...,...
602,2022,SE,FT,Data Engineer,154000,USD,154000,US,100,US,M
603,2022,SE,FT,Data Engineer,126000,USD,126000,US,100,US,M
604,2022,SE,FT,Data Analyst,129000,USD,129000,US,0,US,M
605,2022,SE,FT,Data Analyst,150000,USD,150000,US,100,US,M
606,2022,MI,FT,AI Scientist,200000,USD,200000,IN,100,US,L

# Data description

The following table gives an explanation of each column of our dataset.

| Column name | Description |
| --- | --- | 
| work_year | instant year |
| experience_level | experience of the employee |
| employment_type | working hours |
| job_title | Job description |
| salary | the salary of the local currency |
| salary_currency | local currency |
| salary_in_usd | salary in USD |
| employee_residence | location of the employee |
| remote_ratio | the ration of remote working|
| company_location | location of the company |
| company_size |  size of the company |

# EDA | Explore the data

In [4]:
data.shape

(607, 11)

In [5]:
data.describe()

         work_year        salary  salary_in_usd  remote_ratio
count   607.000000  6.070000e+02     607.000000     607.00000
mean   2021.405272  3.240001e+05  112297.869852      70.92257
std       0.692133  1.544357e+06   70957.259411      40.70913
min    2020.000000  4.000000e+03    2859.000000       0.00000
25%    2021.000000  7.000000e+04   62726.000000      50.00000
50%    2022.000000  1.150000e+05  101570.000000     100.00000
75%    2022.000000  1.650000e+05  150000.000000     100.00000
max    2022.000000  3.040000e+07  600000.000000     100.00000

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 607 entries, 0 to 606
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           607 non-null    int64
 1   experience_level    607 non-null    object
 2   employment_type     607 non-null    object
 3   job_title           607 non-null    object
 4   salary              607 non-null    int64
 5   salary_currency     607 non-null    object
 6   salary_in_usd       607 non-null    int64
 7   employee_residence  607 non-null    object
 8   remote_ratio        607 non-null    int64
 9   company_location    607 non-null    object
 10  company_size        607 non-null    object
dtypes: int64(4), object(7)
memory usage: 56.9+ KB

In [7]:
data.dtypes

work_year              int64
experience_level      object
employment_type       object
job_title             object
salary                 int64
salary_currency       object
salary_in_usd          int64
employee_residence    object
remote_ratio           int64
company_location      object
company_size          object
dtype: object

# Descriptive Statistics

Describe the numerical variables

In [8]:
numericals = data.select_dtypes(np.number)
numericals

            work_year  salary  salary_in_usd  remote_ratio
Unnamed: 0
0                2020   70000          79833             0
1                2020  260000         260000             0
2                2020   85000         109024            50
3                2020   20000          20000             0
4                2020  150000         150000            50
...               ...     ...            ...           ...
602              2022  154000         154000           100
603              2022  126000         126000           100
604              2022  129000         129000             0
605              2022  150000         150000           100
606              2022  200000         200000           100

[607 rows x 4 columns]

Describe the categorical variables

In [9]:
categoricals=[column for column in data.columns if (data[column].dtype==object)] 
categoricals

['experience_level',
 'employment_type',
 'job_title',
 'salary_currency',
 'employee_residence',
 'company_location',
 'company_size']

# Data Cleaning

Check missing values

In [8]:
data.isna().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

Check for nulls

In [9]:
data.isnull().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

Check for duplicates

In [10]:
data.duplicated()

Unnamed: 0
0      False
1      False
2      False
3      False
4      False
       ...
602    False
603    False
604    False
605    False
606    False
Length: 607, dtype: bool

There is no missing values, null values and dublicated values in our database. So no data cleaning tool was needed.

In [ ]:
import matplotlib.pyplot as plt
# Example: Create a bar plot to compare the counts of categorical variables
data['job_title'].value_counts().plot(kind='bar')
plt.title('Job counts')
plt.xlabel('job_title')
plt.ylabel('Count')
plt.show()